# <font color='red'>Data Cleaning and Preparation</font>
During the course of doing data analysis and modeling, a significant amount of time
is spent on data preparation: loading, cleaning, transforming, and rearranging. Such
tasks are often reported to take up 80% or more of an analystâ€™s time. Sometimes the
way that data is stored in files or databases is not in the right format for a particular
task. Many researchers choose to do ad hoc processing of data from one form to
another using a general-purpose programming language, like Python, Perl, R, or Java,
or Unix text-processing tools like sed or awk. Fortunately, pandas, along with the
built-in Python language features, provides you with a high-level, flexible, and fast set
of tools to enable you to manipulate data into the right form.

In [1]:
import pandas as pd
import numpy as np

## Handling Missing Data
The way that missing data is represented in pandas objects is somewhat imperfect,
but it is functional for a lot of users. For numeric data, pandas uses the floating-point
value NaN (Not a Number) to represent missing data. We call this a sentinel value that
can be easily detected:

In [8]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [9]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [10]:
string_data[1]=None
string_data

0    aardvark
1        None
2         NaN
3     avocado
dtype: object

In [12]:
string_data.dropna()

0    aardvark
3     avocado
dtype: object

In [14]:
string_data.fillna(11)

0    aardvark
1          11
2          11
3     avocado
dtype: object

In [15]:
string_data.isnull()

0    False
1     True
2     True
3    False
dtype: bool

In [16]:
string_data.notnull()

0     True
1    False
2    False
3     True
dtype: bool

# Filtering Out Missing Data
With DataFrame objects, things are a bit more complex. You may want to drop rows
or columns that are all NA or only those containing any NAs. dropna by default drops
any row containing a missing value:

In [19]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()
#This is equivalent to:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [21]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
cleaned=data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [22]:
#Passing how='all' will only drop rows that are all NA:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [25]:
#To drop columns in the same way, pass axis=1 :
data[3]=NA
display(data)
data.dropna(axis=1,how='all')

     0    1    2   3
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [31]:
df=pd.DataFrame(np.random.randn(7,3))
df.iloc[2:6,0]=NA
df.iloc[1:3,2]=NA
df

          0         1         2
0 -0.654305  1.234382 -0.141375
1  0.146917  2.148360       NaN
2       NaN  0.324579       NaN
3       NaN  1.058071  0.564012
4       NaN -0.389068  0.079730
5       NaN  0.399291  0.602079
6 -0.056872  1.137850 -1.389623

In [32]:
df.dropna(thresh=2)

          0         1         2
0 -0.654305  1.234382 -0.141375
1  0.146917  2.148360       NaN
3       NaN  1.058071  0.564012
4       NaN -0.389068  0.079730
5       NaN  0.399291  0.602079
6 -0.056872  1.137850 -1.389623

# Filling In Missing Data

In [39]:
df.fillna(0)

          0         1         2
0 -0.654305  1.234382 -0.141375
1  0.146917  2.148360  0.000000
2  0.000000  0.324579  0.000000
3  0.000000  1.058071  0.564012
4  0.000000 -0.389068  0.079730
5  0.000000  0.399291  0.602079
6 -0.056872  1.137850 -1.389623

In [43]:
#Calling fillna with a dict, you can use a different fill value for each column:
df.fillna({0:0.0,2:0.1})

          0         1         2
0 -0.654305  1.234382 -0.141375
1  0.146917  2.148360  0.100000
2  0.000000  0.324579  0.100000
3  0.000000  1.058071  0.564012
4  0.000000 -0.389068  0.079730
5  0.000000  0.399291  0.602079
6 -0.056872  1.137850 -1.389623

In [45]:
#fillna returns a new object, but you can modify the existing object in-place:
_=df.fillna(0,inplace=True)
df

          0         1         2
0 -0.654305  1.234382 -0.141375
1  0.146917  2.148360  0.000000
2  0.000000  0.324579  0.000000
3  0.000000  1.058071  0.564012
4  0.000000 -0.389068  0.079730
5  0.000000  0.399291  0.602079
6 -0.056872  1.137850 -1.389623

In [3]:
df = pd.DataFrame(np.random.randn(6, 3))
df

          0         1         2
0 -0.189746 -0.714072 -1.621184
1  0.666786 -0.961768  0.595006
2  0.234679  0.957953  0.670981
3  0.296876 -1.443527 -1.225088
4  0.551257 -0.883999 -0.145790
5  1.206355  0.138630  1.344040

In [48]:
df.iloc[2:,0]=NA
df.iloc[0:3,2]=NA
df

          0         1         2
0 -0.275880 -0.453614       NaN
1 -1.105181 -1.431437       NaN
2       NaN  0.915049       NaN
3       NaN  0.676129 -0.396727
4       NaN -1.762676  2.462247
5       NaN  1.580312  0.352232

In [50]:
df.fillna(method='ffill',limit=2)

          0         1         2
0 -0.275880 -0.453614       NaN
1 -1.105181 -1.431437       NaN
2 -1.105181  0.915049       NaN
3 -1.105181  0.676129 -0.396727
4       NaN -1.762676  2.462247
5       NaN  1.580312  0.352232

In [52]:
df.fillna(df.mean())

          0         1         2
0 -0.275880 -0.453614  0.805917
1 -1.105181 -1.431437  0.805917
2 -0.690531  0.915049  0.805917
3 -0.690531  0.676129 -0.396727
4 -0.690531 -1.762676  2.462247
5 -0.690531  1.580312  0.352232

In [53]:
df.fillna(value=22)

           0         1          2
0  -0.275880 -0.453614  22.000000
1  -1.105181 -1.431437  22.000000
2  22.000000  0.915049  22.000000
3  22.000000  0.676129  -0.396727
4  22.000000 -1.762676   2.462247
5  22.000000  1.580312   0.352232

In [59]:
df.fillna(method='ffill',axis=1)

          0         1         2
0 -0.275880 -0.453614 -0.453614
1 -1.105181 -1.431437 -1.431437
2       NaN  0.915049  0.915049
3       NaN  0.676129 -0.396727
4       NaN -1.762676  2.462247
5       NaN  1.580312  0.352232

# Data Transformation
   <ol>
    <li><a id >Removing Duplicates</a></li>
    <li><a id ></a></li>
    <li><a id ></a></li>
    <li><a id ></a></li>
    </ol>

In [66]:
rm_Dp=pd.DataFrame({'k1':['one','two']*3 +['two'],
                    'k2':[1, 1, 2, 3, 3, 4, 4]})
rm_Dp

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [70]:
rm_Dp.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [73]:
rm_Dp.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [74]:
rm_Dp['v1']=range(7)
rm_Dp.drop_duplicates('k1')

    k1  k2  v1
0  one   1   0
1  two   1   1

In [77]:
rm_Dp.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

# Transforming Data using function or maping

In [5]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon','pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [6]:
meat_to_animal = {
    'bacon': 'pig','pulled pork': 'pig','pastrami': 'cow',
    'corned beef': 'cow','honey ham': 'pig','nova lox': 'salmon'}
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [7]:
lowercased=data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [8]:
data['animal']=lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [9]:
#We could also have passed a function that does all the work:
data['food'].map(lambda x: meat_to_animal[x.lower()])
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [10]:
data1=pd.DataFrame({
    'items':['Buble','CHocolate','nuts','toffee'],
    'RS':[12,22,33,21]
})
data1

       items  RS
0      Buble  12
1  CHocolate  22
2       nuts  33
3     toffee  21

In [11]:
data_2={'buble':'ahmad likes','chocolate':'Ali Likes','nuts':'shahir likes','toffee':'arosH likes'}

In [12]:
lwrcsd=data1['items'].str.lower()
lwrcsd

0        buble
1    chocolate
2         nuts
3       toffee
Name: items, dtype: object

In [13]:
data1['items'].map(lambda x: data_2[x.lower()])
data1

       items  RS
0      Buble  12
1  CHocolate  22
2       nuts  33
3     toffee  21

In [14]:
data1['favorite']=lwrcsd.map(data_2)

In [121]:
data1

       items  RS      favorite
0      buble  12   ahmad likes
1  chocolate  22     Ali Likes
2       nuts  33  shahir likes
3     toffee  21   arosH likes

In [125]:
#data1['items'].map(lambda x: lwrcsd([x.lower()]))
data1['items'].map(lambda x: data_2[x.lower()])
data1

       items  RS      favorite
0      buble  12   ahmad likes
1  chocolate  22     Ali Likes
2       nuts  33  shahir likes
3     toffee  21   arosH likes

# Replacing Values

In [15]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [16]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [18]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [20]:
#different replcement for each values
data.replace([-999,-1000],[np.nan,0.01])

0    1.00
1     NaN
2    2.00
3     NaN
4    0.01
5    3.00
dtype: float64

In [21]:
# the argument replace can also be dict
data.replace({-999:0,-1000:0.1})

0    1.0
1    0.0
2    2.0
3    0.0
4    0.1
5    3.0
dtype: float64

# Renaming Axis Indexes

In [23]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [27]:
#for series
redata=lambda x:x[:4].upper()
data.index.map(redata)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [30]:
#for dataframe
data.index=data.index.map(redata)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [31]:
#create a transformed version of a dataset without modifying the original, a useful method is rename :
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [36]:
data.rename(index={'OHIO':'indiana'},
            columns={'three':'peekabo'})

         one  two  peekabo  four
indiana    0    1        2     3
COLO       4    5        6     7
NEW        8    9       10    11

# Discretization and Binning
Continuous data is often discretized or otherwise separated into â€œbinsâ€ for analysis.
Letâ€™s divide these into bins of 18 to 25, 26 to 35, 36 to 60, and finally 61 and older. To
do so, you have to use cut , a function in pandas:

In [5]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [8]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [11]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [13]:
cats.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [19]:
pd.cut(ages,[20,27,47,61],right=False)

[[20, 27), [20, 27), [20, 27), [27, 47), [20, 27), ..., [27.0, 47.0), NaN, [27.0, 47.0), [27.0, 47.0), [27.0, 47.0)]
Length: 12
Categories (3, interval[int64]): [[20, 27) < [27, 47) < [47, 61)]

In [18]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [20]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [21]:
data = np.random.rand(20)
pd.cut(data,4,precision=2)

[(0.31, 0.51], (0.31, 0.51], (0.51, 0.71], (0.51, 0.71], (0.51, 0.71], ..., (0.71, 0.91], (0.71, 0.91], (0.71, 0.91], (0.31, 0.51], (0.71, 0.91]]
Length: 20
Categories (4, interval[float64]): [(0.1, 0.31] < (0.31, 0.51] < (0.51, 0.71] < (0.71, 0.91]]

In [22]:
data = np.random.rand(20)
pd.cut(data,4,precision=4)

[(0.4619, 0.6623], (0.6623, 0.8627], (0.6623, 0.8627], (0.4619, 0.6623], (0.06036, 0.2615], ..., (0.2615, 0.4619], (0.06036, 0.2615], (0.06036, 0.2615], (0.06036, 0.2615], (0.4619, 0.6623]]
Length: 20
Categories (4, interval[float64]): [(0.06036, 0.2615] < (0.2615, 0.4619] < (0.4619, 0.6623] < (0.6623, 0.8627]]

In [27]:
nm=np.arange(1,1000)#Normally distributed
pd.cut(nm,4,precision=1) #cuts into 4quartiles

[(0.002, 250.5], (0.002, 250.5], (0.002, 250.5], (0.002, 250.5], (0.002, 250.5], ..., (749.5, 999.0], (749.5, 999.0], (749.5, 999.0], (749.5, 999.0], (749.5, 999.0]]
Length: 999
Categories (4, interval[float64]): [(0.002, 250.5] < (250.5, 500.0] < (500.0, 749.5] < (749.5, 999.0]]

In [28]:
pd.value_counts(nm)

999    1
328    1
341    1
340    1
339    1
      ..
661    1
660    1
659    1
658    1
1      1
Length: 999, dtype: int64

In [29]:
#Similar to cut you can pass your own quantiles (numbers between 0 and 1, inclusive):
pd.qcut(nm, [0, 0.1, 0.5, 0.9, 1.])

[(0.999, 100.8], (0.999, 100.8], (0.999, 100.8], (0.999, 100.8], (0.999, 100.8], ..., (899.2, 999.0], (899.2, 999.0], (899.2, 999.0], (899.2, 999.0], (899.2, 999.0]]
Length: 999
Categories (4, interval[float64]): [(0.999, 100.8] < (100.8, 500.0] < (500.0, 899.2] < (899.2, 999.0]]

# Detecting and Filtering Outlier

In [33]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.002935    -0.022793    -0.055686    -0.004736
std       1.015639     0.986301     0.987935     1.058588
min      -3.320039    -3.206214    -2.896070    -3.107440
25%      -0.724140    -0.709877    -0.691734    -0.758018
50%       0.002793    -0.013392    -0.109678     0.037635
75%       0.669210     0.643867     0.586993     0.747599
max       3.923944     3.034482     3.343151     3.449851

In [37]:
col=data[2]
col[np.abs(col)>3]

642    3.343151
Name: 2, dtype: float64

In [38]:
#select all rows having a value exceeding 3 or â€“3
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
48   3.923944  0.669408 -1.207948 -0.034879
163 -0.532153  3.034482  1.176628  0.773321
220  0.915987 -3.206214  0.123735  0.499890
250 -0.585110 -1.242239 -1.281026  3.449851
370  3.572001  0.344267 -1.510561 -1.467436
400 -1.001067 -3.007579  0.822144 -0.659659
442 -0.018412  1.524769  2.054360  3.192467
642  1.926371 -1.199203  3.343151  0.049188
655 -3.320039 -0.705434  1.135974 -0.742703
903 -1.479426  0.861675 -1.163715 -3.107440
971 -1.034947  0.888476  1.227583  3.082004

In [41]:
#Values can be set based on these criteria. Here is code to cap values outside the interval â€“3 to 3:
data[np.abs(data)>3]=np.sign(data)*3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.004110    -0.022614    -0.056029    -0.005352
std       1.009615     0.985526     0.986813     1.056101
min      -3.000000    -3.000000    -2.896070    -3.000000
25%      -0.724140    -0.709877    -0.691734    -0.758018
50%       0.002793    -0.013392    -0.109678     0.037635
75%       0.669210     0.643867     0.586993     0.747599
max       3.000000     3.000000     3.000000     3.000000

In [42]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0  1.0  1.0
1  1.0  1.0 -1.0 -1.0
2  1.0  1.0 -1.0  1.0
3  1.0 -1.0 -1.0 -1.0
4 -1.0 -1.0  1.0  1.0

In [47]:
df=pd.DataFrame(np.arange(5*4).reshape(5,4))
display(df)
sampler=np.random.permutation(5)
display(sampler)

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

array([2, 4, 3, 1, 0])

In [49]:
#permute works like iloc
df.take(sampler)

    0   1   2   3
2   8   9  10  11
4  16  17  18  19
3  12  13  14  15
1   4   5   6   7
0   0   1   2   3

In [52]:
#To select a random subset without replacement,
df.sample(n=4)

    0   1   2   3
3  12  13  14  15
1   4   5   6   7
2   8   9  10  11
0   0   1   2   3

In [56]:
#To generate a sample with replacement (to allow repeat choices), pass replace=True to sample :
choice=pd.Series([5, 7, -1, 6, 4])
draw=choice.sample(n=10,replace=True)
draw

3    6
1    7
0    5
1    7
2   -1
3    6
3    6
4    4
0    5
2   -1
dtype: int64

In [57]:
# Computing indicator/ Dummy variable
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [66]:
dummies=pd.get_dummies(df['key'],prefix='key')
df_dummies=df[['data1']].join(dummies)
df_dummies

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [85]:
movies=pd.DataFrame({'movie_id':[0,1,2,3,4,5,6,7,8],
                     'title':['Toy Story' ,'Jumanji','Grumpier Old Men','Waiting to Exhale',
                     'Father of the Bride Part II','Heat,Sabrina','Tom and Huck','Sudden Death','GoldenEye'],
                     'genres':['Animation|Childrens|Comedy',
                                   'Adventure|Childrens|Fantasy',
                                    'Comedy|Romance',
                                    'Comedy|Drama',
                                    'Comedy',
                                    'Action|Crime|Thriller',
                                    'Comedy|Romance',
                                    'Adventure|Childrens',
                                    'Action',]})

In [84]:
movies

   movie_id                        title                       genres
0         0                    Toy Story   Animation|Childrens|Comedy
1         1                      Jumanji  Adventure|Childrens|Fantasy
2         2             Grumpier Old Men               Comedy|Romance
3         3            Waiting to Exhale                 Comedy|Drama
4         4  Father of the Bride Part II                       Comedy
5         5                 Heat,Sabrina        Action|Crime|Thriller
6         6                 Tom and Huck               Comedy|Romance
7         7                 Sudden Death          Adventure|Childrens
8         8                    GoldenEye                       Action

In [90]:
all_genres=[]
for x in movies.genres:
    all_genres.extend(x.split('|'))
genres=pd.unique(all_genres)
genres

array(['Animation', 'Childrens', 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller'], dtype=object)

In [92]:
#One way to construct the indicator DataFrame is to start with a DataFrame of all zeros:
zero_matrix = np.zeros((len(movies), len(genres)))

dummies = pd.DataFrame(zero_matrix, columns=genres)
dummies

,Animation,Childrens,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
5,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
6,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
7,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
8,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [97]:
gen = movies.genres[0]
gen

'Animation|Childrens|Comedy'

In [99]:
gen.split('|')

['Animation', 'Childrens', 'Comedy']

In [100]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

In [102]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1
movies_windic = movies.join(dummies.add_prefix('Genre_'))